#include <iostream>
using namespace std;
/*院士奖学金，每人 8000 元，期末平均成绩高于 80 分（>80），并且在本学期内发表 1 篇或 1 篇以上论文的学生均可获得；
五四奖学金，每人 4000 元，期末平均成绩高于 85 分（>85），并且班级评议成绩高于 80 分（>80）的学生均可获得；
成绩优秀奖，每人 2000 元，期末平均成绩高于 90 分（>90）的学生均可获得；
西部奖学金，每人 1000 元，期末平均成绩高于 85 分（>85）的西部省份学生均可获得；
班级贡献奖，每人 850 元，班级评议成绩高于 80 分（>80）的学生干部均可获得；
第一行是 1 个整数 N，表示学生的总数。

接下来的 N 行每行是一位学生的数据，从左向右依次是姓名，
期末平均成绩，班级评议成绩，是否是学生干部，是否是西部省份学生
，以及发表的论文数。姓名是由大小写英文字母组成的长度不超过 20 的字符串
（不含空格）；期末平均成绩和班级评议成绩都是 0 到 100 之间的整数（包括 0 和 100）；
是否是学生干部和是否是西部省份学生分别用 1 个字符表示，Y 表示是，N 表示不是；
发表的论文数是 0 到 10 的整数（包括 0 和 10）。每两个相邻数据项之间用一个空格分隔。

4
YaoLin 87 82 Y N 0
ChenRuiyi 88 78 N Y 1
LiXin 92 88 N N 0
ZhangQin 83 87 Y N 1

ChenRuiyi
9000
28700

*/

int main(){
    int N,examScore,classScore,article;;
    char name,isprime,iswest;
    
    cin>>N;

    
}